; domain
(define (domain farmland)

    (:requirements :typing :fluents)

    (:types
        farm - object
    )

    (:predicates
        (adj ?f1 - farm ?f2 - farm)
    )

    (:functions
        (x ?b - farm)
        (cost)
    )

    ;; Move a person from a unit f1 to a unit f2
    (:action move-fast
        :parameters (?f1 - farm ?f2 - farm)
        :precondition (and (>= (x ?f1) 4) (adj ?f1 ?f2))
        :effect (and(decrease (x ?f1) 4) (increase (x ?f2) 2) (increase (cost) 1))
    )

    (:action move-slow
        :parameters (?f1 - farm ?f2 - farm)
        :precondition (and (>= (x ?f1) 1) (adj ?f1 ?f2))
        :effect (and(decrease (x ?f1) 1) (increase (x ?f2) 1))
    )

)

; problem
(define (problem farmland_7_mixed)
  (:domain farmland)
  (:objects
    farm0 farm1 farm2 farm3 farm4 farm5 farm6 - farm
  )
  (:init
    (= (cost) 0)
    (= (x farm0) 16)
    (= (x farm1) 0)
    (= (x farm2) 0)
    (= (x farm3) 0)
    (= (x farm4) 0)
    (= (x farm5) 0)
    (= (x farm6) 0)
    (adj farm0 farm1)
    (adj farm1 farm0)
    (adj farm0 farm2)
    (adj farm2 farm0)
    (adj farm0 farm3)
    (adj farm3 farm0)
    (adj farm3 farm4)
    (adj farm4 farm3)
    (adj farm4 farm5)
    (adj farm5 farm4)
    (adj farm5 farm6)
    (adj farm6 farm5)
  )
  (:goal
    (and
      (>= (x farm1) 1)
      (>= (x farm2) 1)
      (>= (x farm3) 1)
      (>= (x farm4) 1)
      (>= (x farm5) 1)
      (>= (x farm6) 1)
    )
  )
)

; plan
1. (move-slow farm0 farm3)
   changed: (x farm0) from 16 to 15, (x farm3) from 0 to 1
   goals met: 1 of 6
2. (move-slow farm3 farm4)
   changed: (x farm3) from 1 to 0, (x farm4) from 0 to 1
   goals met: 1 of 6
3. (move-slow farm4 farm5)
   changed: (x farm4) from 1 to 0, (x farm5) from 0 to 1
   goals met: 1 of 6
4. (move-slow farm0 farm1)
   changed: (x farm0) from 15 to 14, (x farm1) from 0 to 1
   goals met: 2 of 6
5. (move-slow farm0 farm2)
   changed: (x farm0) from 14 to 13, (x farm2) from 0 to 1
   goals met: 3 of 6
6. (move-slow farm0 farm3)
   changed: (x farm0) from 13 to 12, (x farm3) from 0 to 1
   goals met: 4 of 6
7. (move-slow farm3 farm4)
   changed: (x farm3) from 1 to 0, (x farm4) from 0 to 1
   goals met: 4 of 6
8. (move-fast farm0 farm3)
   changed: (x farm0) from 12 to 8, (x farm3) from 0 to 2, (cost) from 0 to 1
   goals met: 5 of 6
9. (move-fast farm0 farm3)
   changed: (x farm0) from 8 to 4, (x farm3) from 2 to 4, (cost) from 1 to 2
   goals met: 5 of 6
10. (move-slow farm5 farm6)
   changed: (x farm5) from 1 to 0, (x farm6) from 0 to 1
   goals met: 5 of 6
11. (move-slow farm4 farm5)
   changed: (x farm4) from 1 to 0, (x farm5) from 0 to 1
   goals met: 5 of 6
12. (move-slow farm3 farm4)
   changed: (x farm3) from 4 to 3, (x farm4) from 0 to 1
   goals met: 6 of 6
